test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement_Geometry_Based/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	 ".*"
	 {
		 type            fixedValue;
	 	 value           uniform (0 0 0);
	 }


mantle
{
type fixedValue;
value  nonuniform List<vector>
1568
(
(0.0 -0.0 -1.2246467991473531e-19)
(0.0 -0.0 0.0)
(0.0 -0.0 0.0)
(0.0 1.2246467991473531e-19 -0.0)
(0.0 -0.0 0.0)
(0.0 1.2011155542955977e-19 -2.3891673840699587e-20)
(0.0 -0.0 0.0)
(0.0 1.1314261122884953e-19 -4.686520405307106e-20)
...
);
}
